Repository: archethic-foundation/bridge
Catalog: lib/l10n/intl_*.arb
Languages: fr

# btn_understand
source: I understand
fr: J'ai compris

# btn_copy
source: Copy
fr: Copier

source: Yes
fr: Oui

source: No
fr: Non

# connectionWalletDisconnect
source: Disconnect wallet
fr: Déconnecter le portefeuille

# confirmationPopupTitle
source: Confirmation Request
fr: Demande de confirmation

# connectionWalletDisconnectWarning
source: Are you sure you want to disconnect your wallets and exit the application?
fr: Êtes-vous sûr de vouloir déconnecter vos portefeuilles et quitter l'application ?

# changeCurrentAccountWarning
source: Warning, your current account has been updated.
fr: Attention, votre compte actuel a été mis à jour.

# menu_sourceCode
source: Source code
fr: Code source

# menu_tuto
source: Tutorials
fr: Tutoriels

# menu_privacy_policy
source: Privacy policy
fr: Politique de confidentialité

# menu_terms_of_use
source: Terms of use
fr: Conditions d'utilisation

# menu_report_bug
source: Report a bug
fr: Signaler un bug

# balance_title_infos
source: Balance:
fr: Solde :

# pool_balance_title_infos
source: Pool's balance:
fr: Solde de la pool :

# btn_selectBlockchain
source: Select blockchain
fr: Sélectionner une blockchain

# btn_selectToken
source: Select token
fr: Sélectionner un token

# btn_confirm_bridge
source: Confirm
fr: Confirmer

# btn_resume_bridge
source: Resume
fr: Reprendre

# bridge_blockchain_from_lbl
source: From
fr: De

# bridge_blockchain_to_lbl
source: To
fr: À

# blockchain_selection_title
source: Select a blockchain
fr: Sélectionner une blockchain

# bridge_token_selection_lbl
source: Select a token
fr: Sélectionner un token

# bridge_token_bridged_lbl
source: Target token
fr: Token cible

# bridge_target_address_lbl
source: Bridged tokens will be received at the following address
fr: Les tokens bridgés seront reçus à l'adresse suivante

# bridge_token_amount_lbl
source: Amount to send
fr: Montant à envoyer

# token_selection_title
source: Select a token
fr: Sélectionner un token

source: Address copied
fr: Adresse copiée

# blockchain_selection_test_included_lbl
source: Include testnet ?
fr: Inclure testnet ?

# bridgeConfirm_fees_lbl
source: Fees
fr: Frais

# bridgeConfirm_fees_receive_value_lbl
source: You will receive
fr: Vous recevrez

# bridgesListTitle
source: List of local transactions
fr: Liste des transactions locales

# btn_clear_local_history
source: Clear local informations
fr: Effacer les informations locales

# bridgeConfirmFeesAEProtocolChargeable
source: % of the initial amount
fr: % du montant restant après les frais du module de sécurité

# bridgeConfirmFeesAEProtocolSigned
source: % of the initial amount
fr: % du montant initial

# bridgesListClearWarning
source: Are you sure you want to clear local informations?
fr: Êtes-vous sûr de vouloir effacer les informations locales ?

# bridgeClearWarning
source: Are you sure you want to remove this process from your local informations?
fr: Êtes-vous sûr de vouloir supprimer ce processus de vos informations locales ?

# bridgeInProgressContractsLink
source: Contracts
fr: Contrats

# bridgeSuccessInfo
source: The transfer was completed successfully.
fr: Le transfert a été effectué avec succès.

# bridgeInProgressConfirmEVMWallet
source: Please, confirm a transaction in your EVM Wallet
fr: Veuillez, confirmer une transaction dans votre portefeuille EVM

# bridgeInProgressConfirmAEWallet
source: Please, confirm a transaction in your Archethic Wallet
fr: Veuillez, confirmer une transaction dans votre portefeuille Archethic

# bridgeInProgressWaitConfirmWallet
source: Please wait...
fr: Veuillez patienter...

# localHistoryToLbl
source: to
fr: à

# localHistoryContractLbl
source: Contract
fr: Contrat

# localHistoryStatus
source: Status
fr: Statut

# evmBridgeProcessStep0
source: Process not started
fr: Processus non commencé

# evmBridgeProcessStep1
source: Deploy contract on EVM Blockchain
fr: Déploiement du contrat sur la blockchain EVM

# evmBridgeProcessStep2
source: Get contract lock time
fr: Obtention du temps de verrouillage du contrat

# evmBridgeProcessStep3
source: Provision EVM contract
fr: Provision du contrat EVM

# evmBridgeProcessStep4
source: Get contract's amount
fr: Obtention du montant du contrat

# evmBridgeProcessStep5
source: Deploy contract on Archethic Blockchain
fr: Déploiement du contrat sur la blockchain Archethic

# evmBridgeProcessStep6
source: Withdraw
fr: Retrait

# evmBridgeProcessStep7
source: Reveal secret to Archethic Contract
fr: Révélation du secret au contrat Archethic

# evmBridgeProcessStep8
source: Process finished
fr: Processus terminé

# aeBridgeProcessStep0
source: Process not started
fr: Processus non commencé

# aeBridgeProcessStep1
source: Deploy contract on Archethic Blockchain
fr: Déploiement du contrat sur la blockchain Archethic

# aeBridgeProcessStep2
source: Provision Archethic contract
fr: Provisionnement du contrat Archethic

# aeBridgeProcessStep3
source: Get secret hash from Archethic
fr: Obtention du hash secret d'Archethic

# aeBridgeProcessStep4
source: Deploy contract on EVM Blockchain and provision
fr: Déploiement du contrat sur la blockchain EVM et provisionnement

# aeBridgeProcessStep5
source: Reveal secret from Archethic Pool
fr: Révélation du secret de la pool Archethic

# aeBridgeProcessStep6
source: Reveal secret to EVM Contract
fr: Révélation du secret au contrat EVM

# aeBridgeProcessStep7
source: Withdraw
fr: Retrait

# aeBridgeProcessStep8
source: Process finished
fr: Processus terminé

# failureUserRejected
source: The request has been declined.
fr: La demande a été rejetée.

# failureChainSwitchNotSupported
source: Your EVM wallet doesn't support automatic network switching. Please change it manually in your wallet first.
fr: Votre portefeuille EVM ne prend pas en charge le changement automatique de réseau. Veuillez le changer manuellement dans votre portefeuille d'abord.

# failureConnectivityArchethic
source: Please, open your Archethic Wallet and allow DApps connection.
fr: Veuillez, ouvrir votre portefeuille Archethic et autoriser la connexion aux DApps.

# failureConnectivityArchethicMainnet
source: Please, connect your Archethic wallet to the Mainnet network.
fr: Veuillez, connecter votre portefeuille Archethic au réseau Mainnet.

# failureConnectivityArchethicTestnet
source: Please, connect your Archethic wallet to the Testnet network.
fr: Veuillez, connecter votre portefeuille Archethic au réseau Testnet.

# failureConnectivityArchethicDevnet
source: Please, connect your Archethic wallet to the Devnet network.
fr: Veuillez, connecter votre portefeuille Archethic au réseau Devnet.

# failureConnectivityArchethiRightNetwork
source: Please, connect your Archethic wallet to the right network.
fr: Veuillez, connecter votre portefeuille Archethic au bon réseau.

# failureConnectivityArchethicBrave
source: Please, open your Archethic Wallet, allow DApps connection and disable Brave's shield.
fr: Veuillez, ouvrir votre portefeuille Archethic, autoriser la connexion DApps et désactiver le bouclier Brave.

# failureConnectivityEVM
source: Please, open your EVM Wallet.
fr: Veuillez, ouvrir votre portefeuille EVM.

# failureConnectionFailed
source: Connection failed
fr: Échec de la connexion

# failureParamEVMChain
source: You have selected a network that is not set up in your wallet. Please configure it to use the bridge.
fr: Vous avez sélectionné un réseau qui n'est pas configuré dans votre portefeuille. Veuillez le configurer pour utiliser le bridge.

# failureInsufficientFunds
source: Funds are not sufficient.
fr: Les fonds sont insuffisants.

# failureTimeout
source: Timeout occurred.
fr: Le délai d'attente a été dépassé.

# failurePoolInsufficientFunds
source: The funds of the pool are not sufficient. Please resume your transaction later.
fr: Les fonds de la pool sont insuffisants. Veuillez reprendre votre transaction plus tard.

# failureHTLCWithoutFunds
source: The contract has not received the expected funds
fr: Le contrat n'a pas reçu les fonds attendus

# failureNotHTLC
source: The address doesn't correspond to a contract that may contain funds to bridge. Make sure your wallet is on the right network, the address is from the blockchain source of the transfer and this address contains your funds.
fr: L'adresse ne correspond pas à un contrat qui pourrait contenir des fonds à bridger. Assurez-vous que votre portefeuille est sur le bon réseau, que l'adresse provient de la blockchain source du transfert et que cette adresse contient vos fonds.

# failureIncompatibleBrowser
source: Sorry, but your browser is not compatible with the app. Please refer to the FAQ for more information.
fr: Désolé, mais votre navigateur n'est pas compatible avec l'application. Veuillez vous référer à la FAQ pour plus d'informations.

# failureFaucetUCOError
source: Sorry, the UCO faucet is currently unavailable. Please try again later or directly fund your Archethic wallet.
fr: Désolé, le faucet UCO est actuellement indisponible. Veuillez réessayer plus tard ou alimenter directement votre portefeuille Archethic.

# failureFaucetUCOUserRejected
source: You have declined to sign the transaction required to acquire UCOs for paying your bridge fees. Please resume or directly fund your wallet to continue.
fr: Vous avez refusé de signer la transaction requise pour acquérir des UCOs pour payer vos frais de bridge. Veuillez reprendre ou alimenter directement votre portefeuille pour continuer.

# failureSignedProvisionAsync
source: An error has occurred. Please contact Archethic support, specifying the contract address below and the error '1405'.
fr: Une erreur s'est produite. Veuillez contacter le support d'Archethic en précisant l'adresse du contrat ci-dessous et l'erreur '1405'.

# btn_refund
source: Refund
fr: Rembourser

# btn_refund_evm_connect
source: Connect EVM Wallet
fr: Connecter le portefeuille EVM

# btn_refund_archethic_connect
source: Connect Archethic Wallet
fr: Connecter le portefeuille Archethic

# refund_contract_address_lbl
source: Address of the contract containing the bridged funds
fr: Adresse du contrat contenant les fonds bridgés

# refundCanRefundYes
source: You can refund
fr: Vous pouvez rembourser

# refundCanRefundDateLock
source: You can refund %1 after %2
fr: Vous pouvez rembourser %1 après %2

# refundSuccessInfo
source: The refund has been performed successfully
fr: Le remboursement a été effectué avec succès

# refundAlreadyDoneInfo
source: This contract has already been refunded
fr: Ce contrat a déjà été remboursé

# refundAlreadyWithdrawnInfo
source: This contract has already been withdrawn
fr: Ce contrat a déjà été retiré

# bridgeConfirmArchethicProtocolLbl
source: Protocol fees
fr: Frais du protocole

# local_history_logs_title
source: Logs
fr: Journaux

# local_history_logs_desc
source: In the event of difficulty, you can copy and forward this information to the archethic support team. This information does not contain any information that could affect the security of your funds, but it does provide information for analyzing your problem. However, before sending this information, please note that it contains your Archethic and EVM addresses.
fr: En cas de difficulté, vous pouvez copier et transmettre cette information à l'équipe de support d'Archethic. Cette information ne contient aucune information pouvant affecter la sécurité de vos fonds, mais elle fournit des informations pour analyser votre problème. Cependant, avant d'envoyer cette information, veuillez noter qu'elle contient vos adresses Archethic et EVM.

# local_history_logs_copied
source: Logs copied
fr: Journaux copiés

# local_history_option_delete
source: Delete
fr: Supprimer

# local_history_option_refund
source: Refund
fr: Rembourser

# local_history_option_logs
source: Logs
fr: Journaux

# local_history_option_resume
source: Resume
fr: Reprendre

# local_history_selection_transfer_completed_included_lbl
source: Include transfer completed?
fr: Inclure le transfert terminé ?

# local_history_period_date_lbl
source: Period filter
fr: Filtre de période

source: Logout
fr: Déconnexion

# bridgeProcessInterruptionWarning
source: Are you sure you want to stop the transfer process?
fr: Êtes-vous sûr(e) de vouloir arrêter le processus de transfert ?

# anErrorOccurred
source: An error occurred : {exception}
fr: Une erreur s'est produite : {exception}

# htlcStatusLabelPending
source: Pending
fr: En attente

# htlcStatusLabelWithdrawn
source: Withdrawn
fr: Retiré

# htlcStatusLabelRefunded
source: Refunded
fr: Remboursé

# htlcStatusLabelUnknown
source: Unknown
fr: Inconnu

# htlcStatusHeader
source: Status
fr: Statut

# refundProcessInterruptionWarning
source: Are you sure you want to stop the refund process?
fr: Êtes-vous sûr de vouloir arrêter le processus de remboursement ?

# refundProcessInProgress
source: Refund in progress. Please wait.
fr: Remboursement en cours. Veuillez patienter.

# refundInProgressConfirmEVMWallet
source: Please, confirm a transaction in your EVM Wallet
fr: Veuillez, confirmer une transaction dans votre portefeuille EVM

# bridgeConfirmMessageMaxHalfUCO
source: The UCO amount you entered has been reduced to include Archethic transaction fees.
fr: Le montant en UCO que vous avez entré a été réduit pour inclure les frais de transaction Archethic.

# bridgeFinalAmountLabelAmountBridged
source: Amount bridged:
fr: Montant bridgé :

# bridgeInProgressPopupHeader
source: The transfer process between the 2 blockchains is in progress. This requires a few validations in your wallets to secure the transactions.
fr: Le processus de transfert entre les 2 chaînes est en cours. Cela nécessite quelques validations dans vos portefeuilles pour sécuriser les transactions.

# bridgeInterrupInfoText1
source: Your transfer has been interrupted. You have two options:
fr: Votre transfert a été interrompu. Vous avez deux options :

# bridgeInterrupInfoText2
source: - Resume Transfer: You can attempt to resume the transfer process by clicking "Resume".
fr: - Reprendre le transfert : Vous pouvez tenter de reprendre le processus de transfert en cliquant sur "Reprendre".

# bridgeInterrupInfoText3
source: - Request a Refund: If you do not wish to resume, or if the transfer cannot be completed due to technical reasons, you can choose to get a full refund within 2 hours. To do this, note the following contract address and click later on the "Refund" menu.
fr: - Demander un remboursement : Si vous ne souhaitez pas reprendre, ou si le transfert ne peut être complété pour des raisons techniques, vous pouvez choisir d'obtenir un remboursement complet dans les 2 heures. Pour ce faire, notez l'adresse du contrat suivant et cliquez plus tard sur le menu "Remboursement".

# localHistoryCardStatusInfosTrfInterrupted
source: Transfer interrupted at step
fr: Transfert interrompu à l'étape

# localHistoryCardStatusInfosTrfStopped
source: Transfer stopped at step
fr: Transfert arrêté à l'étape

# localHistoryCardStatusInfosTrfCompleted
source: Transfer completed
fr: Transfert terminé

# localHistoryPeriodFilterConfirmText
source: Select
fr: Sélectionner

# localHistoryPeriodFilterCancelText
source: Cancel
fr: Annuler

# localHistoryPeriodFilterHelpText
source: Please, select a period to filter your history
fr: Veuillez sélectionner une période pour filtrer votre historique

# refundInfosWalletWalletAddressLabel
source: Your wallet address:
fr: Votre adresse de portefeuille :

# refundInfoText1
source: Need help getting your funds back? Don't worry, we'll guide you!
fr: Besoin d'aide pour récupérer vos fonds ? Ne vous inquiétez pas, nous vous guidons !

# refundInfoText2
source: If your transfer didn't go as planned, or if you didn't complete all the necessary steps, you can get your funds back by using our refund function. Here's how it works:
fr: Si votre transfert ne s'est pas déroulé comme prévu, ou si vous n'avez pas complété toutes les étapes nécessaires, vous pouvez récupérer vos fonds en utilisant notre fonction de remboursement. Voici comment cela fonctionne :

# refundInfoText3
source: Identify and fill in the contract address: This is not the address of your wallet, but that of the contract that manages the transfer between blockchains. You need to provide this address to initiate the refund.
fr: Identifiez et remplissez l'adresse du contrat : Ce n'est pas l'adresse de votre portefeuille, mais celle du contrat qui gère le transfert entre blockchains. Vous devez fournir cette adresse pour initier le remboursement.

# refundInfoText4
source: - If you're bridging from an EVM blockchain (such as Ethereum) to Archethic, use the EVM contract address.
fr: - Si vous faites un brigde d'une blockchain EVM (comme Ethereum) vers Archethic, utilisez l'adresse du contrat EVM.

# refundInfoText5
source: - If you are bridging from Archethic to an EVM blockchain, use the Archethic contract address.
fr: - Si vous faites un bridge d'Archethic vers une blockchain EVM, utilisez l'adresse du contrat Archethic.

# welcomeTitleText1
source: Discover a
fr: Découvrez le

# welcomeTitleText2
source: seamless
fr: transfert

# welcomeTitleText3
source: transfer
fr: sans heurts

# welcomeTitleText4
source: of assets
fr: d'actifs

# providerEndpointNotAvailable
source: The provider's endpoint is not available. Please contact Archethic support.
fr: Le point d'accès du fournisseur n'est pas disponible. Veuillez contacter le support Archethic.

# bridgeControlSelectIssuingBC
source: Please select the issuing blockchain.
fr: Veuillez sélectionner la blockchain émettrice.

# bridgeControlSelectReceivingBC
source: Please select the receiving blockchain.
fr: Veuillez sélectionner la blockchain destinataire.

# bridgeControlSelectToken
source: Please select the token to transfer.
fr: Veuillez sélectionner le token à transférer.

# bridgeControlTargetAddress
source: Please enter your receiving address on the target blockchain.
fr: Veuillez entrer votre adresse de réception sur la blockchain cible.

# bridgeControlTargetArchethicAddressValid
source: Please enter a valid Archethic address.
fr: Veuillez entrer une adresse Archethic valide.

# bridgeControlTargetEVMAddressValid
source: Please enter a valid address.
fr: Veuillez entrer une adresse valide.

# bridgeControlAmount
source: Please enter the amount of tokens to transfer.
fr: Veuillez entrer le montant de tokens à transférer.

# bridgeControlAmountTooHigh
source: Your amount exceeds your balance. Please adjust your amount.
fr: Votre montant dépasse votre solde. Veuillez ajuster votre montant.

# bridgeControlInsufficicientLiquidity
source: Sorry, but your request can't be completed due to insufficient liquidity on the destination chain. The current available liquidity is %1 %2.
fr: Désolé, mais votre demande ne peut être complétée en raison d'une liquidité insuffisante sur la chaîne de destination. La liquidité disponible actuelle est de %1 %2.

# refundControlAddressEmpty
source: Please enter a contract address.
fr: Veuillez entrer une adresse de contrat.

# refundControlMalformatedAddress
source: Malformated address.
fr: Adresse malformée.
